In [1]:
import numpy as np
import pandas as pd

# Display 함수
- 하나의 셀에서 여러 Dataframe을 출력할 수 있게함

In [2]:
from IPython.display import display

In [3]:
iris={
"Sepal_Length":[5.1,4.9,4.7,4.6,5  ,5.4,4.6,5  ],
"Sepal_Width": [3.5,3  ,3.2,3.1,3.6,3.9,3.4,3.4]
}

frame1 = pd.DataFrame(data = iris)
frame1
display(frame1)

frame2 = pd.DataFrame(data=[4,5,6,7], index=range(0,4), columns=['A'])
display(frame2)

   Sepal_Length  Sepal_Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6
5           5.4          3.9
6           4.6          3.4
7           5.0          3.4

   A
0  4
1  5
2  6
3  7

# 두개 붙이기

In [4]:
d1={'aa':[111,112,113],'bb':[121,122,123]}
df1=pd.DataFrame(d1)
d2={'aa':[211,212,213],'bb':[221,222,223]}
df2=pd.DataFrame(d2)
display(df1,df2)

    aa   bb
0  111  121
1  112  122
2  113  123

    aa   bb
0  211  221
1  212  222
2  213  223

## 위·아래로 붙이기

In [5]:
pd.concat([df1,df2], ignore_index=True)

    aa   bb
0  111  121
1  112  122
2  113  123
3  211  221
4  212  222
5  213  223

# 가로로 붙이기

In [6]:
pd.concat([df1,df2],axis=1)

    aa   bb   aa   bb
0  111  121  211  221
1  112  122  212  222
2  113  123  213  223

In [7]:
d1a={'aa':[111,112,555],'bb':[121,122,555]}
df1a=pd.DataFrame(d1a,index=[0,1,2])
d2a={'bb':[211,212,555],'dd':[221,222,555]}
df2a=pd.DataFrame(d2a,index=[0,1,3])
display(df1a,df2a)

    aa   bb
0  111  121
1  112  122
2  555  555

    bb   dd
0  211  221
1  212  222
3  555  555

## 위·아래로 붙이기
* 컬럼명 기준

## 위·아래로 붙이기 : outer

In [8]:
pd.concat([df1a,df2a],join='outer',ignore_index=True)

      aa   bb     dd
0  111.0  121    NaN
1  112.0  122    NaN
2  555.0  555    NaN
3    NaN  211  221.0
4    NaN  212  222.0
5    NaN  555  555.0

## 위·아래로 붙이기 : Inner

In [9]:
pd.concat([df1a,df2a], join='inner',ignore_index=True)

    bb
0  121
1  122
2  555
3  211
4  212
5  555

# 가로로 붙이기 
* index 기준

## 가로로 붙이기 : outer

In [10]:
pd.concat([df1a,df2a], join='outer', axis=1)

      aa     bb     bb     dd
0  111.0  121.0  211.0  221.0
1  112.0  122.0  212.0  222.0
2  555.0  555.0    NaN    NaN
3    NaN    NaN  555.0  555.0

## 가로로 붙이기 : inner

In [11]:
pd.concat([df1a,df2a], join='inner', axis=1)

    aa   bb   bb   dd
0  111  121  211  221
1  112  122  212  222